api/app/controllers/posts_controller.rb

  def show
    @posts = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 6)

  def create

    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO `posts` (`title`, `content`, `published_at`, `created_at`, `updated_at`) VALUES('Projeto teste Trampos', 'No Rails 2.3.8, o processo para criar um novo projeto envolve os seguintes passos. Lembre-se de que a versão 2.3.8 é bastante antiga, então certifique-se de que seu ambiente está configurado corretamente para suportá-la. Aqui estão as instruções:', '2024-12-19 18:54:18', '2024-12-19 18:54:18', '2024-12-19 18:54:18')

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `title` = 'Projeto teste Trampos 1', `content` = 'No Rails 2.3.8, o processo para criar um novo projeto envolve os seguintes passos. Lembre-se de que a versão 2.3.8 é bastante antiga, então certifique-se de que seu ambiente está configurado corretamente para suportá-la. Aqui estão as instruções:', `updated_at` = '2024-12-22 23:53:09' WHERE `id` = 6

  def destroy
    @post = Post.find(params[:id])
    logger.debug "Post ID recebido para exclusão: #{params[:id]}"
    @post.destroy
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 25)
DELETE FROM `posts` WHERE `id` = 25